## **Отчёт о тестировании BANK_A**

## Краткое описание

15.12.2021 было проведено тестирование граничных значений приложения BANK_A.

На тестирование затрачено: 3 часа

В результате тестирования выявлены следующие дефекты:
* https://github.com/Baina111/IntroJava/issues/1#issue-1073712912
* https://github.com/Baina111/IntroJava/issues/3#issue-1081411392

## Описание процесса тестирования

В качестве тестовых данных использовались данные https://github.com/Baina111/IntroJava/blob/0696b33a411dd1a05279c24fdf7ff702787b11ca/Main.java:

**Тестирование производилось в следующем окружении:**
* Windows 10 Домашняя 20H2, 64-разрядная;
* Java Eclipse Temurin версии 11.0.12
